Revit 2027 API
MEPSpaceConstruction.SpaceConstructions Property
Return all the Space constructions of current space.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public MEPBuildingConstructionSet SpaceConstructions { get; }
Public ReadOnly Property SpaceConstructions As MEPBuildingConstructionSet
	Get
public:
property MEPBuildingConstructionSet^ SpaceConstructions {
	MEPBuildingConstructionSet^ get ();
}
member SpaceConstructions : MEPBuildingConstructionSet with get
Property Value
MEPBuildingConstructionSet
Remarks
If the name is same with the existing one, an exception will be thrown.
See Also
Reference
MEPSpaceConstruction Class
Autodesk.Revit.DB.Mechanical Namespace